# Entity Properties

---
The Entity type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Schema|  The Schema describing this Entity.
| SchemaGUID|  The GUID of the Schema describing this Entity.
Top
#### Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace